INSERT INTO STUDENT(IDGROUP, NAME, BDAY, INFO)
	VALUES(22, 'Адамович А.М.', '10.07.1998',
	'<студент>
		<паспорт серия="АВ" номер="2864982" дата="26.02.2003" />
		<телефон>375298689745</телефон>
		<адрес>
			<страна>Беларусь</страна>
			<город>Минск</город>
			<улица>Мавра</улица>
			<дом>30</дом>
			<квартира>58</квартира>
		</адрес>
	</студент>');
SELECT * FROM STUDENT WHERE NAME = 'Адамович А.М.';
UPDATE STUDENT SET INFO = '<студент>
					           <паспорт серия="AB" номер="2864982" дата="26.02.2003" />
						       <телефон>375298689745</телефон>
							   <адрес>
								  <страна>Беларусь</страна>
								  <город>Минск</город>
								  <улица>Мавра</улица>
	         					  <дом>30</дом>
								  <квартира>58</квартира>
								</адрес>
							</студент>' WHERE NAME='Адамович А.М.'
SELECT NAME[ФИО], INFO.value('(студент/паспорт/@серия)[1]', 'char(2)')[Серия паспорта],
	INFO.value('(студент/паспорт/@номер)[1]', 'varchar(20)')[Номер паспорта],
	INFO.query('/студент/адрес')[Адрес]
		FROM  STUDENT
			WHERE NAME = 'Адамович А.М.'; 