USE A_MyBase;

INSERT into Товары(Наименование_товара, Цена, Описание, Количество_на_складе)
	VALUES 
	('iPhone 11', 1000, 'Apple A13 Bionic, ОЗУ 4 ГБ, флэш-память 64 ГБ', 10),
	('iPhone 12', 2000, 'Apple A14 Bionic, ОЗУ 4 ГБ, флэш-память 128 ГБ', 20),
	('iPhone 13', 3000, 'Apple A15 Bionic, ОЗУ 4 ГБ, флэш-память 128 ГБ', 30);

INSERT into Покупатели(Покупатель, Телефон, Адрес)
	VALUES
	('ITechArt', '+375(29)223-43-42', 'ул. Толстого 10, Минск'),
	('EPAM', '+375(33)324-24-17', 'ул. Дунина-Марцинкевича 3, Минск'),
	('Wargaming', '+375(29)959-64-38', 'ул. Либаво-Роменская 23, Минск');

INSERT into Сделки(ID_сделки, Покупатель, Дата_сделки, Количество_заказанного_товара, Наименование_товара)
	VALUES
	(1, 'ITechArt', '2022-02-20T11:00:00', 5, 'iPhone 11'),
	(2, 'EPAM', '2022-02-21T13:00:00', 10, 'iPhone 12'),
	(3, 'Wargaming', '2022-02-22T14:00:00', 15, 'iPhone 13');