USE A_MyBase;

-- 1
SELECT max(Цена) [Максимальнеая цена],
	   min(Цена) [Минимальная цена],
	   avg(Цена) [Средняя цена],
	   sum(Цена) [Суммарная цена],
	   count(Цена) [Количество цен]
FROM Товары

-- 2
SELECT Товары.Наименование_товара [Товар],
	   max(Цена) [Максимальнеая цена],
	   min(Цена) [Минимальная цена],
	   avg(Цена) [Средняя цена],
	   sum(Цена) [Суммарная цена],
	   count(Цена) [Количество цен]
FROM Товары
	 INNER JOIN Сделки
	 ON Товары.Наименование_товара = Сделки.Наименование_товара
GROUP BY Товары.Наименование_товара

-- 3
SELECT *
FROM (SELECT
			CASE
				WHEN Товары.Цена = 1000 then '1000'
				WHEN Товары.Цена = 2000 then '2000'
				WHEN Товары.Цена = 3000 then '3000'
			END [Оценки], count(*) [Количество]
FROM Товары GROUP BY 
			CASE
				WHEN Товары.Цена = 1000 then '1000'
				WHEN Товары.Цена = 2000 then '2000'
				WHEN Товары.Цена = 3000 then '3000'
			END 
) as T1
ORDER BY CASE [Оценки]
	WHEN '1000' then 1
	WHEN '2000' then 2
	WHEN '3000' then 3
	ELSE 0
END

-- 4